Repository: haruyama/ssh_rfc_ja
Catalog: omegat/ssh/ssh-level2.tmx
Source language: en_us
Languages: ja

source: Copyright (C) The IETF Trust (2006).
ja: Copyright (C) The IETF Trust (2006). 訳者: 春山 征吾 <haruyama@unixuser.org>.

source: As noted, the actual instructions to the IANA are in [SSH-NUMBERS].
ja: IANA への実際の指示は [SSH-NUMBERS] にあることに注意.

source: X11 Forwarding .....................................24 10.
ja: X11 の転送 .....................................24 10.

source: It's worth pointing out that these items should not be allowed to end up on swap space and that they should be erased from memory as soon as the key exchange completes.
ja: これらのパラメータは, スワップ空間上に置くべきではなく, 鍵交換が終了したらメモリーから消されるべきだということは指摘しておく.

source: The two object identifiers used in Section 2.2.2 were assigned from an arc delegated by IANA to the PKIX Working Group.
ja: 2.2.2 節で用いられる 2つのオブジェクト識別子は, IANA から PKIX ワーキンググループに委任された arc から割り当てられた.

source: The Secure Shell (SSH) Session Channel Break Extension
ja: セキュアシェル (SSH) セッションチャンネルBreak拡張

source: Client Acknowledgement
ja: クライアントの確認応答

source: It is suspected that implementations are likely to make the time delay configurable; a suggested default is 2 seconds.
ja: 実装はこの遅延を設定可能にするかもしれない. 推奨されるデフォルトは 2秒だ.

source: It assumes that this runs over a secure transport layer protocol, which has already authenticated the server machine, established an encrypted communications channel, and computed a unique session identifier for this session.
ja: このプロトコルは, すでにサーバマシンを認証し暗号化されたコミュニケーションチャンネルを確立しセンションのユニークな識別子を計算した, 安全なトランスポート層プロトコルの上で動くことを仮定している.

source: The version number was incremented after changes in the handling of status packets.
ja: 状態パケットの処理に変更があったのでバージョン番号が増えた.

source: Further, GCM authentication uses operations that are particularly well suited to efficient implementation in hardware, making it especially appealing for high-speed implementations or for implementations in an efficient and compact circuit.
ja: さらに, GCM 認証は, ハードウェアでの高速な実装に特に良く適した操作を用いる. 非常に高速な実装や効率的でコンパクトな回路での実装にとって魅力的だ.

source: If there is a session with a matching tmSessionID, tmTransportAddress, and tmSecurityName, then select that session.
ja: tmSessionID, tmTransportAddress, tmSecurityName に一致するセッションがあれば, そのセッションを選択する.

source: A request that requires further messages to be exchanged will be aborted by a subsequent request.
ja: メッセージの交換が何度か必要な要求は,次の要求によって中止されることがある.

source: They might, however, occasionally be displayed in logs, reports, etc. They MUST be encoded using ISO 10646 UTF-8, but other encodings may be required in some cases.
ja: しかし, これらは時にはログやレポートなどに表示される. これらは,ISO 10646 UTF-8 を用いてエンコードされなければならない. しかし, 時には別のエンコーディングが必要とされる.

source: This document instantiates the recommendations described in [BKN1,BKN2].
ja: この文書は, [BKN1,BKN2] に記述された推奨を具体的に記述している.

source: Each server host SHOULD have a host key.
ja: サーバホストは, ホスト鍵を持つ必要がある.

source: The security protocols used in the Secure Shell Authentication Protocol [RFC4252] and the Secure Shell Transport Layer Protocol [RFC4253] are considered acceptably secure at the time of writing.
ja: セキュアシェル認証プロトコル [RFC4252] と セキュアシェルトランスポート層プロトコル [RFC4253] を用いるセキュリティプロトコルは, 執筆時点では許容できるレベルで安全だと考えられている.

source: Specification of the message numbers SSH_MSG_KEX_ECDH_INIT and SSH_MSG_KEX_ECDH_REPLY is found in Section 7.
ja: SSH_MSG_KEX_ECDH_INIT と SSH_MSG_KEX_ECDH_REPLY のメッセージ番号の定義は, 7節にある.

source: The 'user name' and 'service name' are repeated in every new authentication attempt, and MAY change.
ja: 'user name' と 'service name' は, すべての新しい認証の試行のたびに繰り替えされる. もしくは, 変更されることもある.

source: Families of Non-Signature Algorithms in SecSh-B
ja: SecSh-B の署名以外のアルゴリズムのファミリ

source: As we shall see below, SSH AES-GCM requires a 12-octet Initial IV and an encryption key of either 16 or 32 octets.
ja: 以下で見るように, SSH AES-GCM 12-オクテットの初期 IV と 16 か 32 オクテットの暗号鍵を必要とする.

source: The following table lists the initial assignments of Public Key Subsystem Response names.
ja: 次の表で, 公開鍵サブシステムの応答名の初期の割り当てを示す.

source: o "::" means to listen on all IPv6 addresses.
ja: o "::" は, すべてのIPv6アドレスで受け入れることを意味する.

source: SSH is increasingly being used to replace Telnet for terminal access applications.
ja: SSH は ターミナルアクセスアプリケーションとして Telnet を置き換えるためにだんだんと使われ出している.

source: An example of a possible strategy is to only accept a host key without checking the first time a host is connected, save the key in a local database, and compare against that key on all future connections to that host.
ja: 可能な方法の例として, 最初にホストに接続した際だけはチェックなしでホスト鍵を受け入れ, 鍵をローカルなデータベースに保存し, 以降のそのホストへのすべての接続では鍵を比較する, というものがある.

source: The identity of the client MUST also be verified and authenticated by the server according to local policy to ensure that the incoming client request is legitimate before any configuration or state data is sent to or received from the client.
ja: クライアントの識別情報も, 設定や状態の情報をクライアントに送ったりクライアントから受け取ったりする前に, 受け取ったクライアントの要求が正当なものであることを保証するために, ローカルなポリシーに基づいて, サーバにより検証し認証されなければならない.

source: For example, compromise of a certificate's private key or issuance of a certificate to the wrong party are common reasons to revoke a certificate.
ja: 例えば, 証明書の秘密鍵の漏洩や間違った相手への証明書の発行が, 証明書を失効させる一般的な理由だ.

source: Skipping Public Key Verification
ja: 公開鍵検証のスキップ

source: The IESG is considered to be the owner of all such key exchange methods; this does NOT imply that the IESG is considered to be the owner of the underlying GSS-API mechanism.
ja: IESG はこのすべての鍵交換法のオーナーと見なされる． これは， IESG が基底の GSS-API メカニズムのオーナーであることを意味しないことに注意．

source: The value of 'signature' is a signature with the private host key of the following data, in this order:
ja: 'signature' の値は, 次の順番のデータに対する秘密鍵による署名だ:

source: which algorithm the other side is using, and MAY send an initial key exchange packet according to the algorithm, if appropriate for the preferred method.
ja: どちらの側も, 相手側が用いるアルゴリズムを推測してもよい. また, 優先の方法にとって適切ならば, そのアルゴリズムに従った初期鍵交換パケットを送ってもよい.

source: 3) The X.509v3 certificates MUST use only the two Suite B digital signatures, ECDSA-256 and ECDSA-384.
ja: 3) X.509v3 証明書は, 2つの Suite B 電子署名(アルゴリズム), ECDSA-256 と ECDSA-384 のみを用いなければならない.

source: Recommended Curves
ja: 推奨される曲線

source: See the Elements of Procedure in Section 5 for detailed processing instructions on the use of the tmStateReference fields by the SSH Transport Model.
ja: SSH トランスポートモデルによる tmStateReference の利用の上での詳細な処理の手順については, 5節の 処理の手順を参照せよ.

source: If a request completed successfully, the server MUST send the status code SSH_PUBLICKEY_SUCCESS.
ja: 要求が正常に完了したら, 状態コード SSH_PUBLICKEY_SUCCESS をサーバは送らなければならない.

source: The use of public key authentication assumes that the client host has not been compromised.
ja: 公開鍵認証の利用では, クライアントのホストが侵害されてないことを前提とする.

source: o Each following certificate MUST certify the one preceding it.
ja: o 2番目以降の証明書は, 1つ前のものを証明しなければならない.

source: Future Assignments ..................................6 4.2.
ja: 将来の割り当て.................................6 4.2.

source: At this time, it appears likely that a future specification will promote aes128-ctr to be REQUIRED; implementation of this algorithm is very strongly encouraged.
ja: この時点で, 将来の仕様では aes128-ctr を要求されている(必須である)に格付けするようだ. このアルゴリズムの実装は非常に強く推奨されている.

source: Currently, the only defined service name is "ssh-connection", which refers to the SSH connection protocol [SSH-CONNECT].
ja: 現在, (この場面で)唯一定義されたサービス名は "ssh-connection" で, SSH コネクションプロトコル [SSH-CONNECT] を参照する.

source: At present, the best known algorithm is the Pollard-rho method.
ja: 現在, もっとも良く知られているアルゴリズムは, Pollard-rho 素因数分解法だ.

source: Security Considerations ........................................30 9.1.
ja: セキュリティの考察 ........................................30 9.1.

source: The actual names of the submethods is something the user and the server need to agree upon.
ja: submethods の実際の名前は, ユーザとサーバの間で同意が必要だ.

source: However, since the re-exchange is a public key operation, it requires a fair amount of processing power and should not be performed too often.
ja: しかし, 鍵交換は公開鍵の操作で, かなりの処理量を必要とするので頻繁に行ないすぎないほうがよい.

source: The Disconnection Message 'description' string gives a more specific explanation in a human-readable form.
ja: 切断メッセージの 'description' 文字列は, より具体的な説明を人間が読める形で提供する.

source: Subject Header
ja: Subject ヘッダ

source: The MAC algorithm names are listed in Section 6.4.
ja: MAC アルゴリズム名は, 6.4 節に挙げられている.

source: In some cases, it is possible to obtain improved security by allowing access only if the client sends a valid message integrity code (MIC) binding the GSS-API context to the keys used for encryption and integrity protection of the SSH session.
ja: SSHのセッションの暗号化と完全性保護に用いられ鍵にGSS-API コンテキストを束縛する正当なメッセージ完全性コード (MIC) をクライアントが送った場合にもアクセスを許可することで、 セキュリティを向上させられる場合がある.

source: Compatibility With Old SSH Versions .............................5 5.1.
ja: 古い SSH のバージョンとの互換性 .............................5 5.1.

source: SecSh-B uses ECDSA-256/384 for server authentication, user authentication, and in X.509 certificates.
ja: SecSh-B は, サーバ認証, ユーザ認証, X.509 証明書に ECDSA-256/384 を用いる.

source: Session Data Transfer
ja: セッションのデータ転送

source: Each of the algorithm name-lists MUST be a comma-separated list of algorithm names (see Algorithm Naming in [SSH-ARCH] and additional information in [SSH-NUMBERS]).
ja: アルゴリズムの名前リストのそれぞれは, アルゴリズム名のカンマ区切りリストでなければならない ( [SSH-ARCH] の Algorithm Naming と [SSH-NUMBERS] の追加の情報を参照).

source: The client and server each hash K, K_T, and the various key-exchange parameters to generate the exchange hash, H, which is used to generate the encryption keys for the session, and the server signs H with its host key and sends the signature to the client.
ja: クライアントとサーバはそれぞれ, Kや K_T いくつかの鍵交換のパラメータをハッシュ化して交換ハッシュ H を生成する. 交換ハッシュ H はセッションのための暗号化鍵を生成するのに使われる. サーバはそのホスト鍵でHに署名し, 署名をクライアントに送る.

source: If this is done, the client software should take the precautions discussed in [SSH-ARCH].
ja: もし表示するなら, クライアントソフトウェアは, [SSH-ARCH]で議論した予防措置を取らなければならない.

source: (See Section 6.1.)
ja: (6.1節参照)

source: Null Host Key Algorithm
ja: null ホスト鍵アルゴリズム

source: Security Considerations ........................................24 10.
ja: セキュリティの考察 ........................................24 10.

source: Connection Setup
ja: 接続のセットアップ

source: Pseudo-Random Number Generation
ja: 擬似乱数の生成

source: The underlying construct is discussed in [RFC2104].
ja: 基礎概念は, [RFC2104] で議論されている.

source: This protocol provides a mechanism that allows client authentication data to be uploaded and manipulated.
ja: このプロトコルは, クライアントの認証データをアップロードし操作できるメカニズムを提供する.

source: The meanings of message numbers in the range of 60 to 79 are specific to the user authentication method in use, and their meaning will be specified by the definition of that method.
ja: 60から79の範囲のメッセージ番号は, 利用する認証法に特有だ. その意味は方法の定義で決まる.T

source: etc. Implementers SHOULD provide recommendations on how best to do this with their implementation.
ja: 実装者は, その実装で利用できる最良の仕組みへの推奨を提供する必要がある.

source: This document freely uses terminology and notation from the architecture document without reference or further explanation.
ja: この文書は, 参照や説明なしにアーキテクチャ文書から用語や表記法を自由に利用する.

source: However, X11 display forwarding in SSH (or other secure protocols), combined with actual and pseudo-displays that accept connections only over local IPC mechanisms authorized by permissions or access control lists (ACLs), does correct many X11 security problems, as long as the "none" MAC is not used.
ja: しかし, "none" MACが使われない限り, SSH(ないし他の安全なプロトコル)でのX11のディスプレイの転送は, パーミッションないしアクセスコントロールリスト(ACL)によって認定された ローカルな IPC メカニズム上でのみ接続を受け付ける実際と擬似のディスプレイを組合せることで, 多くのX11のセキュリティ問題を修正する.

source: SSH connections may be initiated by command generators or by notification originators.
ja: SSH 接続は, コマンド生成器 (command generator) や通知の発信者 (notification originator) によって開始されることがある.

source: Symbolic Name reason code ------------- ----------- SSH_DISCONNECT_HOST_NOT_ALLOWED_TO_CONNECT 1 SSH_DISCONNECT_PROTOCOL_ERROR 2 SSH_DISCONNECT_KEY_EXCHANGE_FAILED 3 SSH_DISCONNECT_RESERVED 4 SSH_DISCONNECT_MAC_ERROR 5 SSH_DISCONNECT_COMPRESSION_ERROR 6 SSH_DISCONNECT_SERVICE_NOT_AVAILABLE 7 SSH_DISCONNECT_PROTOCOL_VERSION_NOT_SUPPORTED 8 SSH_DISCONNECT_HOST_KEY_NOT_VERIFIABLE 9 SSH_DISCONNECT_CONNECTION_LOST 10 SSH_DISCONNECT_BY_APPLICATION 11 SSH_DISCONNECT_TOO_MANY_CONNECTIONS 12 SSH_DISCONNECT_AUTH_CANCELLED_BY_USER 13 SSH_DISCONNECT_NO_MORE_AUTH_METHODS_AVAILABLE 14 SSH_DISCONNECT_ILLEGAL_USER_NAME 15
ja: シンボル名 reason code ------------- ----------- SSH_DISCONNECT_HOST_NOT_ALLOWED_TO_CONNECT 1 SSH_DISCONNECT_PROTOCOL_ERROR 2 SSH_DISCONNECT_KEY_EXCHANGE_FAILED 3 SSH_DISCONNECT_RESERVED 4 SSH_DISCONNECT_MAC_ERROR 5 SSH_DISCONNECT_COMPRESSION_ERROR 6 SSH_DISCONNECT_SERVICE_NOT_AVAILABLE 7 SSH_DISCONNECT_PROTOCOL_VERSION_NOT_SUPPORTED 8 SSH_DISCONNECT_HOST_KEY_NOT_VERIFIABLE 9 SSH_DISCONNECT_CONNECTION_LOST 10 SSH_DISCONNECT_BY_APPLICATION 11 SSH_DISCONNECT_TOO_MANY_CONNECTIONS 12 SSH_DISCONNECT_AUTH_CANCELLED_BY_USER 13 SSH_DISCONNECT_NO_MORE_AUTH_METHODS_AVAILABLE 14 SSH_DISCONNECT_ILLEGAL_USER_NAME 15

source: In addition, the hash is calculated using only "n" instead of "min || n || max".
ja: さらに, "min || n || max" の代わりに "n" のみを用いてハッシュが計算される.

source: The following public key authentication algorithms are currently available for use in SSH:
ja: 現在 SSH で利用できる 公開鍵アルゴリズムは以下だ.

source: Normally, SPNEGO provides the added benefit of protecting the GSS-API mechanism negotiation.
ja: 通常, GSS-API メカニズムの交渉の保護に利益をもたらす.

source: Note that the message text may contain multiple lines separated by carriage return-line feed (CRLF) sequences.
ja: 注意: message text はキャリッジリターン-ラインフィード (CRLF) シーケンスで区切られた複数行を含むかもしれない.

source: Public Key Subsystem Response Names .
ja: 公開鍵サブシステムの応答名 .

source: The initial value of H is saved for use as the session_id.
ja: H の初期値は session_id として用いられるために保存される.

source: Public Key Subsystem Operations .
ja: 公開鍵サブシステムの操作 .

source: The NETCONF server MUST NOT process any NETCONF messages received after the <close-session> operation.
ja: NETCONF サーバは, <close-session> 操作の後で受け取ったすべての NETCONF メッセージを処理してはならない.

source: Authentication Requests
ja: 認証の要求

source: The dimension parameters are only informational.
ja: 次元パラメータは, 単に情報を提供するだけだ.

source: Arcfour (and RC4) has problems with weak keys, and should be used with caution.
ja: Arcfour (と RC4) には弱い鍵の問題がある. 注意しながら利用するべきだ.

source: The Secure Shell Transport Layer Protocol authenticates the server to the host but does not authenticate the user (or the user's host) to the server.
ja: セキュアシェルトランスポート層プロトコルはサーバをホストに認証するが, ユーザ(ないしユーザのホスト)をサーバに認証しない.

source: One big issue is the character set of the interactive session.
ja: インタラクティブなセッションでの文字セットは大きな問題だ.

source: Strong distinguishers distinguish an Arcfour keystream from randomness at the start of the stream and are defended against by the algorithm defined in this document.
ja: 強い識別者による攻撃では, Arcfourの鍵ストリームからストリームと最初の乱数を識別する. この文書で定義したアルゴリズムで防御される.

source: This protocol is assumed to run on top of a secure, authenticated transport.
ja: このプロトコルは, 安全で認証済みのトランスポート上で動くことを仮定している.

source: The value of 'signature' is a signature by the corresponding private key over the following data, in the following order:
ja: 'signature' の値は, 次の順番のデータに対する対応する秘密鍵による署名だ:

source: This document also recommends that SSH servers be configurable to allow access to the "netconf" SSH subsystem over other ports.
ja: この文書は, 他のポートでの "netconf" SSH サブシステムへのアクセスを SSH サーバが設定可能にすることも推奨する.

source: Use of that configuration option without corresponding changes to firewall or network device configuration may unintentionally result in the ability for nodes outside of the firewall or other administrative boundaries to gain access to the "netconf" SSH subsystem.
ja: ファイアウォールやネットワークデバイスの設定を対応して変更することなしにこの設定項目を利用すると, "netconf" SSH サブシステムへのアクセスを得ようとする ファイアウォールや他の管理境界の外にあるノードの接続に意図しない影響を与える可能性がある.

source: IANA Considerations .............................................7 8.
ja: IANA の考慮 .............................................7 8.

source: The following MAC algorithms are currently defined:
ja: 以下の MAC アルゴリズムが現在定義されている:

source: The purpose of this document is to show how the AES Galois Counter Mode can be used to provide both confidentiality and data integrity to the SSH Transport Layer Protocol.
ja: この文書の目的は, AES Galois (ガロア) カウンタモードがSSH トランスポート層プロトコルに機密性とデータ完全性の両方を提供するためにどのように用いられるかを示すことだ.

source: If the attacker does not have any way to see the packet yet (i.e., it is in the internal buffers of the SSH implementation or even in the kernel), then this attack will not work.
ja: 攻撃者がパケット(すなわち, SSHの実装やOSのカーネル中の内部バッファ)を見る方法がなければ, この攻撃はできない.

source: Symbolic name data_type_code ------------- -------------- SSH_EXTENDED_DATA_STDERR 1
ja: シンボル名 data_type_code ------------- -------------- SSH_EXTENDED_DATA_STDERR 1

source: Any server sending this message MUST ignore any SSH_MSG_UNIMPLEMENTED sent by the client in response.
ja: このメッセージを送るサーバは, クライアントから応答として送られる SSH_MSG_UNIMPLEMENTED を無視しなければならない.

source: When displaying text to a user, such as error or debug messages, the client software SHOULD replace any control characters (except tab, carriage return, and newline) with safe sequences to avoid attacks by sending terminal control characters.
ja: エラーやデバッグのメッセージのようなユーザにテキストを表示する際, クライアントのソフトウェアはタブとキャリッジリターン, 改行を除くすべての制御文字を安全なシーケンスに置換する必要がある. これは, 端末制御文字を送られることによる攻撃を避けるためだ.

source: Their values are defined in Section 5 and Section 6 for the two methods defined by this document.
ja: これらの値は, この文書で定義する2つの方法のために, 5節と6節で定義される.

source: All such messages depend on the authentication 'method name' used, and the client MAY at any time continue with a new SSH_MSG_USERAUTH_REQUEST message, in which case the server MUST abandon the previous authentication attempt and continue with the new one.
ja: そのようなメッセージは, 利用する認証の 'method_name' に依存する. クライアントは, いつでも新しい SSH_MSG_USERAUTH_REQUEST を送ってよい. このとき, サーバは以前の認証の試行を放棄し新しいもので認証を継続しなければならない.

source: SSH provides the "none" userauth method.
ja: SSH は "none" ユーザ認証法を提供している.

source: The "twofish192-cbc" cipher is the same as above, but with a 192-bit key.
ja: "twofish192-cbc" 暗号は, 同様の暗号だが, 192-bit の鍵を使う.

source: Cached Information and References
ja: キャッシュされる情報とリファレンス

source: The parameter SHOULD be 0 if this flag is FALSE, and 1 if it is TRUE.
ja: FALSEならパラメータを0に, TRUE なら 1 にする必要がある.

source: In all cases, the size of the returned group SHOULD be at least 1024 bits.
ja: すべての場合で, 少なくとも 1024 bit のサイズの群を返す必要がある.

source: If the key length needed is longer than the output of the HASH, the key is extended by computing HASH of the concatenation of K and H and the entire key so far, and appending the resulting bytes (as many as HASH generates) to the key.
ja: HASHの出力よりも必要な鍵長が長い場合は, K と H とそれまでの鍵すべてを連結したものの HASH を計算し結果のバイトを(HASHが生成するのと同じだけ)追加して鍵は拡張される.

source: Servers should take care that when doing this, clients are not able to override presets from the server's administrator.
ja: これを行なう際サーバは注意する必要がある. クライアントはサーバの管理者の事前設定を上書きできない.

source: These are the general authentication message codes:
ja: 以下が, 認証法に依存しない認証メッセージの番号だ.

source: The server MUST NOT attempt to interpret or act upon the content of the comment field in any way.
ja: サーバは, comment フィールドの内容について, どのようなやり方でも解釈しようとしてはいけないし, またどのようなやり方でも内容に基づいて行動しようとしてはいけない.

source: As required in [RFC4253], the random_padding MUST be at least 4 octets in length but no more than 255 octets.
ja: [RFC4253] で要求されているように, random_padding は 最低 4 オクテット長なければならない. また 255 オクテットを越えてはならない.

source: It consists of three major components:
ja: SSH は3つの主要な要素から構成されている:

source: Key Exchange ...................................................15 7.1.
ja: 鍵交換.................................................15 7.1.

source: Secure Shell Transport Model for the Simple Network Management Protocol (SNMP)
ja: シンプルネットワークマネジメントプロトコル (SNMP) のための セキュアシェルトランスポートモデル

source: A list of the REQUIRED and RECOMMENDED curves and their OIDs can be found in Section 10.
ja: 必須/推奨の曲線とそのOIDのリストは, 10節にある.

source: Galois Counter Mode (GCM) is a mode of operation for block ciphers that provides both confidentiality and data integrity.
ja: Galois カウンタモード (GCM) は, 機密性とデータ完全性の両方を提供するブロック暗号の操作のモードだ.

source: Several authentication methods with different security characteristics are allowed.
ja: 異なるセキュリティの特質を持ったいくつかの認証法が許されている.

source: The name "diffie-hellman-group1-sha1" is used for a key exchange method using an Oakley group, as defined in [RFC2409].
ja: 名前 "diffie-hellman-group1-sha1" は, [RFC2409]で定義されている Oakley群を用いる鍵交換法のために用いられる.

source: Impact on Network Operation ...............................14 9.
ja: ネットワーク操作への影響 ...............................14 9.

source: Denial of Service
ja: サービス妨害

source: 7) At minLOS_128, all SecSh-B implementations MUST be able to verify ECDSA-256 signatures and SHOULD be able to verify ECDSA-384 signatures, unless it is absolutely certain that the implementation will never need to verify certificates originating from an authority that uses an ECDSA-384 signing key.
ja: 7) minLOS_128 の場合, すべての SecSh-B 実装は ECDSA-256 署名を検証できなければならない. また, ECDSA-384 署名鍵を用いる認証局で発行される証明書を検証する必要が決して生じないと実装が完全に確認できない場合は, ECDSA-384 署名を検証できる必要がある.

source: The following channel-specific request can be sent over a session channel (as described in [4]) to request that the remote host perform a BREAK operation.
ja: 次のチャンネル特有のリクエストが, リモートホストで BREAK 操作を行なう要求のために ([4] で記述されている) セッションチャンネル上で送られる.

source: Authentication begins when the client sends an SSH_MSG_USERAUTH_REQUEST, which specifies the mechanism OIDs the client supports.
ja: 認証は， クライアントが， サポートするメカニズムのOIDを指定する SSH_MSG_USERAUTH_REQUEST を送ることで始まる．

source: How SSHTM Fits into the Transport Subsystem .....................8 3.1.
ja: どのように SSHTM はトランスポートサブシステムに適合するか .....................8 3.1.

source: Currently, common practice is to quote the Header-value of the Comment by prefixing and suffixing it with '"' characters, and some existing implementations fail if these quotation marks are omitted.
ja: 現在, コメントのHeader-value を '"' 文字を前置と後置してクォートするのが慣習となっている. いくつかの既存の実装が, この引用符がないと失敗する.

source: Both of these and the User-based Security Model typically used with SNMPv3 derive the securityName and securityLevel from the SNMP message received, even when the message was received over a secure transport.
ja: これらと SNMPv3 で典型的に用いられる User-based Security Model のどちらも, 安全なトランスポート上でメッセージが受信された場合でも, 受信した SNMP メッセージから securityName と securityLever を導出する.

source: Implementations of Arcfour are typically slightly faster and much smaller than those of any other encryption algorithm currently defined for SSH.
ja: Arcfourの実装は, 現在SSHで指定されている他の暗号アルゴリズムのものよりもわずかに早くまたかなり小さい.

source: The following table identifies the initial assignment of the Encryption Algorithm Names.
ja: 次の表で, 暗号アルゴリズムの名前の初期の割り当てを示す.

source: In the event of a GSS-API error on the server, the server MAY send the following message before terminating the connection:
ja: GSS-APIエラーがサーバで起きたら, サーバは接続の切断の前に次のメッセージを送ってもよい:

source: First SSH_MSG_USERAUTH_REQUEST Message ....................10 5.2.
ja: 最初の SSH_MSG_USERAUTH_REQUEST メッセージ ....................10 5.2.

source: BK (Block Cipher Key) The appropriate Encryption Key formed during the Key Exchange.
ja: BK (Block Cipher Key) 鍵交換時に生成された適切な暗号鍵.

source: 60 ECHOCTL Echo control characters as ^(Char).
ja: 60 ECHOCTL ＾文字付きでコントロール文字をエコーする.

source: IANA has opened a new registry for the SSHFP RR type for public key algorithms.
ja: IANA は, 公開鍵アルゴリズムのための SSHFP RR タイプの新しいレジストリを開いた.

source: Throughout this document, the terms "client" and "server" are used to refer to the two ends of the SSH transport connection.
ja: この文書を通して, 用語"クライアント" と "サーバ" は SSH トランスポート接続の両端を差すのに用いる.

source: A byte represents an arbitrary 8-bit value (octet).
ja: byte は任意の8-bitの値(octet)を表す.

source: This message implies that the authentication is about to fail, and is defined to allow the error token to be communicated without losing synchronization.
ja: このメッセージは, 認証が失敗しようとしていることを意味している. また, 同期を失なうことなしにエラートークンを通信できるよう定義されている.
